tutorials/cfdemSolverRhoPimpleChem/Hematite_GOD0k1/CFD/constant/foam.inp
species
(
        CO
        CO2
	N2
);

reactions
{
}


